config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-21 Tue 22:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs config</title>
<meta name="author" content="Jay Lee" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">My Emacs config</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb26c530">1. Package management</a>
<ul>
<li><a href="#orgd326ef5">1.1. MELPA</a></li>
<li><a href="#org1f3b0e2">1.2. Modernized package menu</a></li>
<li><a href="#orgd13cf5b">1.3. Better package setup</a></li>
</ul>
</li>
<li><a href="#orgdc1ebbe">2. Pretty Emacs</a>
<ul>
<li><a href="#orgb80565e">2.1. Theme</a></li>
<li><a href="#orgf91f891">2.2. Font</a></li>
<li><a href="#orga2b0d26">2.3. Icons</a></li>
<li><a href="#orgfcc3e9f">2.4. Modeline Theme</a></li>
<li><a href="#org279a416">2.5. Miscellaneous</a></li>
</ul>
</li>
<li><a href="#org39ef09a">3. Key bindings</a>
<ul>
<li><a href="#org3a7ff46">3.1. Hints</a></li>
<li><a href="#org3ba50b7">3.2. Navigation</a></li>
<li><a href="#org6efe633">3.3. Miscellaneous</a></li>
</ul>
</li>
<li><a href="#org1a52e42">4. Languages</a>
<ul>
<li><a href="#org90e834e">4.1. Lisps</a>
<ul>
<li><a href="#org439830c">4.1.1. Scheme</a></li>
</ul>
</li>
<li><a href="#org7330a01">4.2. OCaml</a></li>
<li><a href="#orga93cfdb">4.3. Python</a></li>
<li><a href="#org3665485">4.4. Org mode</a>
<ul>
<li><a href="#orga806413">4.4.1. LaTeX</a></li>
</ul>
</li>
<li><a href="#orgf4398a8">4.5. Miscellaneous</a></li>
</ul>
</li>
<li><a href="#orgb7929ef">5. Dired</a></li>
<li><a href="#orgd114007">6. Terminal and shell</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb26c530" class="outline-2">
<h2 id="orgb26c530"><span class="section-number-2">1.</span> Package management</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd326ef5" class="outline-3">
<h3 id="orgd326ef5"><span class="section-number-3">1.1.</span> MELPA</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'package)
(add-to-list 'package-archives
	     '("melpa" . "https://melpa.org/packages/") t)
(package-initialize)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f3b0e2" class="outline-3">
<h3 id="org1f3b0e2"><span class="section-number-3">1.2.</span> Modernized package menu</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Use <code>paradox</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package paradox
  :init (paradox-enable))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd13cf5b" class="outline-3">
<h3 id="orgd13cf5b"><span class="section-number-3">1.3.</span> Better package setup</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Use <code>use-package</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-and-compile
  ; Always make sure packages are installed correctly at every startup
  (setq use-package-always-ensure t
	use-package-expand-minimally t))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdc1ebbe" class="outline-2">
<h2 id="orgdc1ebbe"><span class="section-number-2">2.</span> Pretty Emacs</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb80565e" class="outline-3">
<h3 id="orgb80565e"><span class="section-number-3">2.1.</span> Theme</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Although <a href="https://github.blog/2022-06-08-sunsetting-atom/">Atom is being sunset by GitHub</a>, the default theme it provided is one of the best-looking and easy-on-the-eyes color scheme out in the wild.
<code>doom-one</code> theme is more actively maintained than <code>atom-one-dark-theme</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package doom-themes
  :ensure t
  :config
  (setq doom-themes-enable-bold t
	doom-themes-enable-italic t)
  (load-theme 'doom-one t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf91f891" class="outline-3">
<h3 id="orgf91f891"><span class="section-number-3">2.2.</span> Font</h3>
<div class="outline-text-3" id="text-2-2">
<p>
JuliaMono provides the most comprehensive unicode support.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-frame-font "JuliaMono 15" nil t)
; Apply the font to emacsclients
(add-to-list 'default-frame-alist '(font . "JuliaMono 15"))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2b0d26" class="outline-3">
<h3 id="orga2b0d26"><span class="section-number-3">2.3.</span> Icons</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package all-the-icons
  :if (display-graphic-p))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfcc3e9f" class="outline-3">
<h3 id="orgfcc3e9f"><span class="section-number-3">2.4.</span> Modeline Theme</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package doom-modeline
  :hook (after-init . doom-modeline-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org279a416" class="outline-3">
<h3 id="org279a416"><span class="section-number-3">2.5.</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Seamless title bar in macOS.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(tool-bar-mode -1)
(use-package ns-auto-titlebar
  :config (ns-auto-titlebar-mode))
</pre>
</div>

<p>
Line numbering.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-display-line-numbers-mode)
</pre>
</div>

<p>
Get rid of irritating beep-boops.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun flash-mode-line ()
  (invert-face 'mode-line)
  (run-with-timer 0.1 nil #'invert-face 'mode-line))
(setq visible-bell nil ring-bell-function #'flash-mode-line)
</pre>
</div>

<p>
Prettify symbols.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-prettify-symbols-mode 1)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org39ef09a" class="outline-2">
<h2 id="org39ef09a"><span class="section-number-2">3.</span> Key bindings</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3a7ff46" class="outline-3">
<h3 id="org3a7ff46"><span class="section-number-3">3.1.</span> Hints</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Show what key bindings are available.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package which-key
  :config (which-key-mode))
</pre>
</div>

<p>
Show completions.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy
  :config
  (ivy-mode)
  (setq ivy-use-virtual-buffers t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ba50b7" class="outline-3">
<h3 id="org3ba50b7"><span class="section-number-3">3.2.</span> Navigation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Incremental search using ivy.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package swiper
  :after ivy
  :bind ("C-s" . swiper-isearch))
</pre>
</div>

<p>
Use numbering to move frames.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package window-numbering
  :config (window-numbering-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6efe633" class="outline-3">
<h3 id="org6efe633"><span class="section-number-3">3.3.</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Use command as meta in macOS.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq mac-command-modifier 'meta)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1a52e42" class="outline-2">
<h2 id="org1a52e42"><span class="section-number-2">4.</span> Languages</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org90e834e" class="outline-3">
<h3 id="org90e834e"><span class="section-number-3">4.1.</span> Lisps</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Pseudo-structural editing.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package paredit
  :init
  (autoload 'enable-paredit-mode "paredit"
    "Turn on pseudo-structural editing of Lisp code."
    t)
  :config
  (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'scheme-mode-hook #'enable-paredit-mode))
</pre>
</div>

<p>
Prettify lambda.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun prettify-lambda ()
  "Prettify lambda"
  (push '("lambda" . 955) prettify-symbols-alist))
</pre>
</div>
</div>

<div id="outline-container-org439830c" class="outline-4">
<h4 id="org439830c"><span class="section-number-4">4.1.1.</span> Scheme</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Set scheme interpreter to Chicken Scheme.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq scheme-program-name "csi")
</pre>
</div>

<p>
Use <code>geiser</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package geiser-chicken)
</pre>
</div>

<p>
Prettify symbols.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'scheme-mode-hook #'prettify-lambda)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7330a01" class="outline-3">
<h3 id="org7330a01"><span class="section-number-3">4.2.</span> OCaml</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Opam setup.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'opam-user-setup "~/.emacs.d/opam-user-setup.el")
</pre>
</div>
</div>
</div>

<div id="outline-container-orga93cfdb" class="outline-3">
<h3 id="orga93cfdb"><span class="section-number-3">4.3.</span> Python</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Use <code>elpy</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package elpy
  :init (elpy-enable))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3665485" class="outline-3">
<h3 id="org3665485"><span class="section-number-3">4.4.</span> Org mode</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Font size and symbols.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-superstar
  :config
  ;; hide #+TITLE:
  (setq org-hidden-keywords '(title))
  ;; set basic title font
  (set-face-attribute 'org-level-8 nil :weight 'bold :inherit 'default)
  ;; Low levels are unimportant = no scaling
  (set-face-attribute 'org-level-7 nil :inherit 'org-level-8)
  (set-face-attribute 'org-level-6 nil :inherit 'org-level-8)
  (set-face-attribute 'org-level-5 nil :inherit 'org-level-8)
  (set-face-attribute 'org-level-4 nil :inherit 'org-level-8)
  ;; Top ones get scaled the same as in LaTeX (\large, \Large, \LARGE)
  (set-face-attribute 'org-level-3 nil :inherit 'org-level-8 :height 1.2) ;\large
  (set-face-attribute 'org-level-2 nil :inherit 'org-level-8 :height 1.44) ;\Large
  (set-face-attribute 'org-level-1 nil :inherit 'org-level-8 :height 1.728) ;\LARGE
  ;; Only use the first 4 styles and do not cycle.
  (setq org-cycle-level-faces nil)
  (setq org-n-level-faces 4)
  ;; Document Title, (\huge)
  (set-face-attribute 'org-document-title nil
		      :height 2.074
		      :foreground 'unspecified
		      :inherit 'org-level-8)
  (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))
</pre>
</div>

<p>
Prettify symbols.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook
 'org-mode-hook
 (lambda ()
   "Prettify Org mode symbols"
   (push '("[ ]" . "☐") prettify-symbols-alist)
   (push '("[X]" . "☑") prettify-symbols-alist)
   (push '("[-]" . "❍") prettify-symbols-alist)))
</pre>
</div>

<p>
Do not open a new window when editing source.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-src-window-setup 'current-window)
</pre>
</div>

<p>
Babel.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-do-load-languages
  'org-babel-load-languages
  '((scheme . t)
    (python . t)))
(setq org-confirm-babel-evaluate nil)
</pre>
</div>
</div>

<div id="outline-container-orga806413" class="outline-4">
<h4 id="orga806413"><span class="section-number-4">4.4.1.</span> LaTeX</h4>
<div class="outline-text-4" id="text-4-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ox
  :ensure nil
  :config
  (setq org-format-latex-options
	(plist-put org-format-latex-options :scale 1.5))
  (setq org-latex-create-formula-image-program 'dvisvgm)
  (setq org-preview-latex-default-process 'dvisvgm))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf4398a8" class="outline-3">
<h3 id="orgf4398a8"><span class="section-number-3">4.5.</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Visually match parentheses.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rainbow-delimiters
  :config (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb7929ef" class="outline-2">
<h2 id="orgb7929ef"><span class="section-number-2">5.</span> Dired</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dired
  :ensure nil
  :config (setq dired-kill-when-opening-new-dired-buffer t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd114007" class="outline-2">
<h2 id="orgd114007"><span class="section-number-2">6.</span> Terminal and shell</h2>
<div class="outline-text-2" id="text-6">
<p>
Use <code>vterm</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vterm)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jay Lee</p>
<p class="date">Created: 2022-06-21 Tue 22:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
